
## Plan Result (aat)




<pre><code>Plan: 9 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.servicebus_premium_primary_connection_string
  * module.queue-premium.azurerm_servicebus_queue.servicebus_queue
  * module.queue-premium.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.queue-premium.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.servicebus-namespace-premium.azurerm_servicebus_namespace.servicebus_namespace
  * module.servicebus-namespace-premium.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
  * module.subscription-premium.azurerm_servicebus_subscription.servicebus_subscription
  * module.topic-premium.azurerm_servicebus_topic.servicebus_topic
  * module.topic-premium.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule
* Update
  * module.feepay-fail-action-group.azurerm_resource_group_template_deployment.action-group
  * module.feepay-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.servicebus_premium_primary_connection_string will be created
  + resource "azurerm_key_vault_secret" "servicebus_premium_primary_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat"
      + name                    = "sb-premium-primary-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.feepay-fail-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.Resources/deployments/feepay_alert"
        name                = "feepay_alert"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.feepay-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.Resources/deployments/feepay-fail-alert"
        name                = "feepay-fail-alert"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.queue-premium.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "ccpay-servicebus-aat-premium"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "ccpay-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.queue-premium.azurerm_servicebus_queue.servicebus_queue will be created
  + resource "azurerm_servicebus_queue" "servicebus_queue" {
      + auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S"
      + dead_lettering_on_message_expiration    = true
      + default_message_ttl                     = "P10675199DT2H48M5.4775807S"
      + duplicate_detection_history_time_window = "PT10M"
      + enable_batched_operations               = true
      + enable_express                          = false
      + enable_partitioning                     = false
      + id                                      = (known after apply)
      + lock_duration                           = "PT1M"
      + max_delivery_count                      = 10
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = 1024
      + name                                    = "ccpay-service-callback-retry-queue"
      + namespace_id                            = (known after apply)
      + requires_duplicate_detection            = false
      + requires_session                        = false
      + status                                  = "Active"
    }

  # module.queue-premium.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "ListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.queue-premium.azurerm_servicebus_queue_authorization_rule.send_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "SendSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.servicebus-namespace-premium.azurerm_servicebus_namespace.servicebus_namespace will be created
  + resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      + capacity                            = 0
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + local_auth_enabled                  = true
      + location                            = "uksouth"
      + minimum_tls_version                 = (known after apply)
      + name                                = "ccpay-servicebus-aat-premium"
      + premium_messaging_partitions        = 0
      + public_network_access_enabled       = true
      + resource_group_name                 = "ccpay-aat"
      + sku                                 = "Standard"
      + tags                                = {
          + "Deployment Environment" = "aat"
          + "Team Contact"           = "#fee-pay-nightly-pipeline"
          + "Team Name"              = "cc-payments"
          + "application"            = "fees-and-payments"
          + "autoShutdown"           = "true"
          + "builtFrom"              = "https://github.com/HMCTS/ccpayfr-shared-infrastructure.git"
          + "businessArea"           = "CFT"
          + "contactSlackChannel"    = "#cc-payments"
          + "environment"            = "staging"
          + "managedBy"              = "Fees/Pay"
        }
      + zone_redundant                      = false
    }

  # module.servicebus-namespace-premium.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule will be created
  + resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "SendAndListenSharedAccessKey"
      + namespace_id                      = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.subscription-premium.data.azurerm_servicebus_topic.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "ccpay-service-callback-topic"
      + namespace_name                          = "ccpay-servicebus-aat-premium"
      + requires_duplicate_detection            = (known after apply)
      + resource_group_name                     = "ccpay-aat"
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.subscription-premium.azurerm_servicebus_subscription.servicebus_subscription will be created
  + resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      + auto_delete_on_idle                       = "P10675199DT2H48M5.4775807S"
      + client_scoped_subscription_enabled        = false
      + dead_lettering_on_filter_evaluation_error = true
      + dead_lettering_on_message_expiration      = true
      + default_message_ttl                       = "P10675199DT2H48M5.4775807S"
      + enable_batched_operations                 = false
      + forward_dead_lettered_messages_to         = "ccpay-service-callback-retry-queue"
      + id                                        = (known after apply)
      + lock_duration                             = "PT1M"
      + max_delivery_count                        = 1
      + name                                      = "serviceCallbackPremiumSubscription"
      + requires_session                          = false
      + status                                    = "Active"
      + topic_id                                  = (known after apply)
    }

  # module.topic-premium.data.azurerm_resource_group.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "this" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "ccpay-aat"
      + tags       = (known after apply)
    }

  # module.topic-premium.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "ccpay-servicebus-aat-premium"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "ccpay-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.topic-premium.azurerm_servicebus_topic.servicebus_topic will be created
  + resource "azurerm_servicebus_topic" "servicebus_topic" {
      + auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S"
      + default_message_ttl                     = "P10675199DT2H48M5.4775807S"
      + duplicate_detection_history_time_window = "PT10M"
      + enable_batched_operations               = false
      + enable_express                          = false
      + enable_partitioning                     = false
      + id                                      = (known after apply)
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = 1024
      + name                                    = "ccpay-service-callback-topic"
      + namespace_id                            = (known after apply)
      + requires_duplicate_detection            = false
      + status                                  = "Active"
      + support_ordering                        = false
    }

  # module.topic-premium.azurerm_servicebus_topic_authorization_rule.send_listen_auth_rule will be created
  + resource "azurerm_servicebus_topic_authorization_rule" "send_listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "SendAndListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
      + topic_id                          = (known after apply)
    }

Plan: 9 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":91,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->